Wadu436/ArduinoCore-samd/boards.txt
# Menu: USB Stack
adafruit_pyportal_m4_titano.menu.usbstack.arduino=Arduino
adafruit_pyportal_m4_titano.menu.usbstack.tinyusb=TinyUSB
adafruit_pyportal_m4_titano.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB

# Menu: Debug
adafruit_pyportal_m4_titano.menu.debug.off=Off
adafruit_pyportal_m4_titano.menu.debug.on=On
adafruit_pyportal_m4_titano.menu.debug.on.build.flags.debug=-g


# -----------------------------------
# Adafruit pyBadge M4 Express (SAMD51)
# -----------------------------------
adafruit_pybadge_m4.name=Adafruit pyBadge M4 Express (SAMD51)

# VID/PID for Bootloader, Arduino & CircuitPython
adafruit_pybadge_m4.vid.0=0x239A
adafruit_pybadge_m4.pid.0=0x8033
adafruit_pybadge_m4.vid.1=0x239A
adafruit_pybadge_m4.pid.1=0x0033
adafruit_pybadge_m4.vid.2=0x239A
adafruit_pybadge_m4.pid.2=0x8034
adafruit_pybadge_m4.vid.3=0x239A
adafruit_pybadge_m4.pid.3=0x0034

# Upload
adafruit_pybadge_m4.upload.tool=bossac18
adafruit_pybadge_m4.upload.protocol=sam-ba
adafruit_pybadge_m4.upload.maximum_size=507904
adafruit_pybadge_m4.upload.offset=0x4000
adafruit_pybadge_m4.upload.use_1200bps_touch=true
adafruit_pybadge_m4.upload.wait_for_upload_port=true
adafruit_pybadge_m4.upload.native_usb=true

# Build
adafruit_pybadge_m4.build.mcu=cortex-m4
adafruit_pybadge_m4.build.f_cpu=120000000L
adafruit_pybadge_m4.build.usb_product="pyBadge M4 Express"
adafruit_pybadge_m4.build.usb_manufacturer="Adafruit"
adafruit_pybadge_m4.build.board=PYBADGE_M4
adafruit_pybadge_m4.build.core=arduino
adafruit_pybadge_m4.build.extra_flags=-D__SAMD51J19A__ -DCRYSTALLESS -DADAFRUIT_PYBADGE_M4_EXPRESS -D__SAMD51__ -D__FPU_PRESENT -DARM_MATH_CM4 -mfloat-abi=hard -mfpu=fpv4-sp-d16 {build.usb_flags}
adafruit_pybadge_m4.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
adafruit_pybadge_m4.build.openocdscript=scripts/openocd/daplink_samd51.cfg
adafruit_pybadge_m4.build.variant=pybadge_m4
adafruit_pybadge_m4.build.variant_system_lib=
adafruit_pybadge_m4.build.vid=0x239A
adafruit_pybadge_m4.build.pid=0x8033
adafruit_pybadge_m4.bootloader.tool=openocd
adafruit_pybadge_m4.bootloader.file=featherM4/bootloader-feather_m4-v2.0.0-adafruit.5.bin
adafruit_pybadge_m4.compiler.arm.cmsis.ldflags="-L{runtime.tools.CMSIS-5.4.0.path}/CMSIS/Lib/GCC/" "-L{build.variant.path}" -larm_cortexM4lf_math -mfloat-abi=hard -mfpu=fpv4-sp-d16

# Menu: Cache
adafruit_pybadge_m4.menu.cache.on=Enabled
adafruit_pybadge_m4.menu.cache.on.build.cache_flags=-DENABLE_CACHE
adafruit_pybadge_m4.menu.cache.off=Disabled
adafruit_pybadge_m4.menu.cache.off.build.cache_flags=

# Menu: Speed
adafruit_pybadge_m4.menu.speed.120=120 MHz (standard)
adafruit_pybadge_m4.menu.speed.120.build.f_cpu=120000000L
adafruit_pybadge_m4.menu.speed.150=150 MHz (overclock)
adafruit_pybadge_m4.menu.speed.150.build.f_cpu=150000000L
adafruit_pybadge_m4.menu.speed.180=180 MHz (overclock)
adafruit_pybadge_m4.menu.speed.180.build.f_cpu=180000000L
adafruit_pybadge_m4.menu.speed.200=200 MHz (overclock)
adafruit_pybadge_m4.menu.speed.200.build.f_cpu=200000000L

# Menu: Optimization
adafruit_pybadge_m4.menu.opt.small=Small (-Os) (standard)
adafruit_pybadge_m4.menu.opt.small.build.flags.optimize=-Os
adafruit_pybadge_m4.menu.opt.fast=Fast (-O2)
adafruit_pybadge_m4.menu.opt.fast.build.flags.optimize=-O2
adafruit_pybadge_m4.menu.opt.faster=Faster (-O3)
adafruit_pybadge_m4.menu.opt.faster.build.flags.optimize=-O3
adafruit_pybadge_m4.menu.opt.fastest=Fastest (-Ofast)
adafruit_pybadge_m4.menu.opt.fastest.build.flags.optimize=-Ofast
adafruit_pybadge_m4.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
adafruit_pybadge_m4.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops

# Menu: QSPI Speed
adafruit_pybadge_m4.menu.maxqspi.50=50 MHz (standard)
adafruit_pybadge_m4.menu.maxqspi.50.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=50000000
adafruit_pybadge_m4.menu.maxqspi.fcpu=CPU Speed / 2
adafruit_pybadge_m4.menu.maxqspi.fcpu.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=({build.f_cpu})

# Menu: USB Stack
adafruit_pybadge_m4.menu.usbstack.arduino=Arduino
adafruit_pybadge_m4.menu.usbstack.tinyusb=TinyUSB
adafruit_pybadge_m4.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB

# Menu: Debug
adafruit_pybadge_m4.menu.debug.off=Off
adafruit_pybadge_m4.menu.debug.on=On
adafruit_pybadge_m4.menu.debug.on.build.flags.debug=-g


# -----------------------------------
# Adafruit Metro M4 AirLift Lite (SAMD51)
# -----------------------------------
adafruit_metro_m4_airliftlite.name=Adafruit Metro M4 AirLift Lite (SAMD51)

# VID/PID for Bootloader, Arduino & CircuitPython
adafruit_metro_m4_airliftlite.vid.0=0x239A
adafruit_metro_m4_airliftlite.pid.0=0x8037
adafruit_metro_m4_airliftlite.vid.1=0x239A
adafruit_metro_m4_airliftlite.pid.1=0x0037

# Upload
adafruit_metro_m4_airliftlite.upload.tool=bossac18
adafruit_metro_m4_airliftlite.upload.protocol=sam-ba
adafruit_metro_m4_airliftlite.upload.maximum_size=507904
adafruit_metro_m4_airliftlite.upload.offset=0x4000
adafruit_metro_m4_airliftlite.upload.use_1200bps_touch=true
adafruit_metro_m4_airliftlite.upload.wait_for_upload_port=true
adafruit_metro_m4_airliftlite.upload.native_usb=true

# Build
adafruit_metro_m4_airliftlite.build.mcu=cortex-m4
adafruit_metro_m4_airliftlite.build.f_cpu=120000000L
adafruit_metro_m4_airliftlite.build.usb_product="Metro M4 AirLift Lite"
adafruit_metro_m4_airliftlite.build.usb_manufacturer="Adafruit"
adafruit_metro_m4_airliftlite.build.board=METRO_M4_AIRLIFT_LITE
adafruit_metro_m4_airliftlite.build.core=arduino
adafruit_metro_m4_airliftlite.build.extra_flags=-D__SAMD51J19A__ -DADAFRUIT_METRO_M4_AIRLIFT_LITE -D__SAMD51__ -D__FPU_PRESENT -DARM_MATH_CM4 -mfloat-abi=hard -mfpu=fpv4-sp-d16 {build.usb_flags}
adafruit_metro_m4_airliftlite.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
adafruit_metro_m4_airliftlite.build.openocdscript=scripts/openocd/daplink_samd51.cfg
adafruit_metro_m4_airliftlite.build.variant=metro_m4_airlift
adafruit_metro_m4_airliftlite.build.variant_system_lib=
adafruit_metro_m4_airliftlite.build.vid=0x239A
adafruit_metro_m4_airliftlite.build.pid=0x8037
adafruit_metro_m4_airliftlite.bootloader.tool=openocd
adafruit_metro_m4_airliftlite.bootloader.file=metroM4/bootloader-metro_m4-v2.0.0-adafruit.5.bin
adafruit_metro_m4_airliftlite.compiler.arm.cmsis.ldflags="-L{runtime.tools.CMSIS-5.4.0.path}/CMSIS/Lib/GCC/" "-L{build.variant.path}" -larm_cortexM4lf_math -mfloat-abi=hard -mfpu=fpv4-sp-d16

# Menu: Cache
adafruit_metro_m4_airliftlite.menu.cache.on=Enabled
adafruit_metro_m4_airliftlite.menu.cache.on.build.cache_flags=-DENABLE_CACHE
adafruit_metro_m4_airliftlite.menu.cache.off=Disabled
adafruit_metro_m4_airliftlite.menu.cache.off.build.cache_flags=

# Menu: Speed
adafruit_metro_m4_airliftlite.menu.speed.120=120 MHz (standard)
adafruit_metro_m4_airliftlite.menu.speed.120.build.f_cpu=120000000L
adafruit_metro_m4_airliftlite.menu.speed.150=150 MHz (overclock)
adafruit_metro_m4_airliftlite.menu.speed.150.build.f_cpu=150000000L
adafruit_metro_m4_airliftlite.menu.speed.180=180 MHz (overclock)
adafruit_metro_m4_airliftlite.menu.speed.180.build.f_cpu=180000000L
adafruit_metro_m4_airliftlite.menu.speed.200=200 MHz (overclock)
adafruit_metro_m4_airliftlite.menu.speed.200.build.f_cpu=200000000L

# Menu: Optimization
adafruit_metro_m4_airliftlite.menu.opt.small=Small (-Os) (standard)
adafruit_metro_m4_airliftlite.menu.opt.small.build.flags.optimize=-Os
adafruit_metro_m4_airliftlite.menu.opt.fast=Fast (-O2)
adafruit_metro_m4_airliftlite.menu.opt.fast.build.flags.optimize=-O2
adafruit_metro_m4_airliftlite.menu.opt.faster=Faster (-O3)
adafruit_metro_m4_airliftlite.menu.opt.faster.build.flags.optimize=-O3
adafruit_metro_m4_airliftlite.menu.opt.fastest=Fastest (-Ofast)
adafruit_metro_m4_airliftlite.menu.opt.fastest.build.flags.optimize=-Ofast
adafruit_metro_m4_airliftlite.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
adafruit_metro_m4_airliftlite.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops

# Menu: QSPI Speed
adafruit_metro_m4_airliftlite.menu.maxqspi.50=50 MHz (standard)
adafruit_metro_m4_airliftlite.menu.maxqspi.50.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=50000000
adafruit_metro_m4_airliftlite.menu.maxqspi.fcpu=CPU Speed / 2
adafruit_metro_m4_airliftlite.menu.maxqspi.fcpu.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=({build.f_cpu})

